In [9]:
#creating dataframes
#a dataframe is a two dimensional array which arranges data into multiple columns
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [10]:
import pandas as pd
#creating a dataframe from a dictionary
mydataset={'cars':["Tesla","Audi","Jeep"], 'year':[2021,2017,2020]}
myvar=pd.DataFrame(mydataset)
print(myvar)

    cars  year
0  Tesla  2021
1   Audi  2017
2   Jeep  2020

In [11]:
#accessing the data
print(myvar.cars)

0    Tesla
1     Audi
2     Jeep
Name: cars, dtype: object

In [12]:
#acessing first item
print(myvar.cars[0])

Tesla

In [13]:
#creating series
#a series is a one dimensional array which arranges data into rows
mydict={"days":["Monday", "Tuesday", "Wednesday"], "dates":["21/3/2022", "16/4/2023", "12/5/2004"]}
myseries=pd.Series(mydict)
print(myseries)

days          [Monday, Tuesday, Wednesday]
dates    [21/3/2022, 16/4/2023, 12/5/2004]
dtype: object

In [14]:
#printing only the days
print(myseries[0])

['Monday', 'Tuesday', 'Wednesday']

In [19]:
#printing dates for only Monday and Tuesday
print(myseries.dates[0:2])

['21/3/2022', '16/4/2023']

# Data analysis assignment

Using mine.csv dataset

In [41]:
import pandas as pd
#Reading my dataset
df = pd.read_csv('C:/Users/ADMIN/Downloads/LEARN DATASCIENCE/mine.csv')
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [24]:
#using the head() function to get the general overview of the dataset through printing the first 7 rows
print(df.head(7))

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0

In [25]:
#using the tail() function to see the last 7 rows of the dataset
print(df.tail(7))

     Duration  Pulse  Maxpulse  Calories
162        45     95       130     270.0
163        45    100       140     280.9
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [26]:
#using the shape() functon to determine the number of rows and columns in the dataset
print(df.shape)

(169, 4)

In [27]:
#using the info() function to get basic information about the dataset forexample the non-null values in each column and datatypes of the columns
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB
None

In [28]:
#summing up null values(rows) in each column
df.isnull().sum().sort_values(ascending=False)

Calories    5
Duration    0
Pulse       0
Maxpulse    0
dtype: int64

In [35]:
#using the dropna() function to drop rows with nulls in calories column
new_df=df.dropna()
print(new_df.shape)   #printing the number of rows and columns in the new dataset without null rows

(164, 4)

In [33]:
#summing up null values(rows) in each column of new dataset/dataframe
new_df.isnull().sum().sort_values(ascending=False)

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [36]:
#using the fillna() method to fill the null values instead of deleting them using the mean value of the calories column
filled_df=df.fillna(df.mean())
print(filled_df.shape)

(169, 4)

In [39]:
#summing up null values(rows) in each column of filled dataset/dataframe
filled_df.isnull().sum().sort_values(ascending=False)

Duration    0
Pulse       0
Maxpulse    0
Calories    0
dtype: int64

In [61]:
#printing duplicates rows according to the duration column. Duplicates rows in a dataset are those that have identical values across all columns or a subset of columns
duplicates=filled_df.duplicated()
duplicate_rows=df[duplicates]
duplicate_rows

     Duration  Pulse  Maxpulse  Calories
36         60    102       127     300.0
37         60    100       120     300.0
38         60    100       120     300.0
40         45     90       112     180.1
71         60    109       153     387.6
113        45    100       120     225.3
155        60    111       151     368.5

In [62]:
#summing up the duplicates rows/ duplicate
filled_df.duplicated().sum()

7

In [63]:
#removing duplicates from the dataset
clean_df=filled_df.drop_duplicates()
print(clean_df.shape)

(162, 4)

In [54]:
#determing correlation(relationship) between pairs of the numerical dataset using corr() function
#correlation is always between -1 and 1
#-1 shows a strong negative correlation, 0 indicates no correlation while 1 indicates a strong positive correlation 
correlation_matrix= clean_df.corr()
correlation_matrix

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.162098  0.003578  0.921907
Pulse    -0.162098  1.000000  0.787035  0.015408
Maxpulse  0.003578  0.787035  1.000000  0.194031
Calories  0.921907  0.015408  0.194031  1.000000

Using Work.csv dataset

In [15]:
import pandas as pd
#Reading my dataset
df2 = pd.read_csv('C:/Users/ADMIN/Downloads/LEARN DATASCIENCE/Work.csv')
df2

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [16]:
#using the shape() functon to determine the number of rows and columns in the dataset
print(df2.shape)

(7, 4)

In [17]:
#using the info() function to get basic information about the dataset forexample the non-null values in each column and datatypes of the columns
print(df2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes
None

In [18]:
#summing up null values(rows) in each column
df2.isnull().sum().sort_values(ascending=False)

age         1
py-score    1
Name        0
city        0
dtype: int64

In [19]:
#using the dropna() function to drop rows with nulls in the specific columns 
new_df2=df2.dropna()
print(new_df2.shape)   #printing the number of rows and columns in the new dataset without null rows

(5, 4)

In [20]:
#using the fillna() method to fill the null values instead of deleting them using a specified values and a dictionary
fill_values={
    'age':22,
    'py-score':80
}
filled_df2=df2.fillna(value=fill_values)
filled_df2

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone     22       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train       80
6   Jesca      Mbarara     21       84

In [21]:
#removing wrong data: livinstone is not city 
clean_df2=filled_df2[filled_df2['city'] != 'Livingstone'] 
clean_df2

     Name     city    age py-score
0    Emma  Kampala     23       90
1  Wilber    Mbale     26       75
2   Robin     Gulu     25     mine
4    Yeko   Tororo     20       94
5  Miriam     Arua  Train       80
6   Jesca  Mbarara     21       84

In [22]:
clean_df2.shape

(6, 4)

In [23]:
#removing data with wrong formats (string) in age column
#notnull().all(axis=1) checks if all the values in each row across the specified columns are not null
clean_df2=clean_df2[pd.to_numeric(clean_df2['age'], errors='coerce').notnull()]  #pd.to_numeric() converts the values in the specified column to numeric type
                                                                                #non-numeric values are converted to NaN using errors='coerce'
clean_df2

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [24]:
#removing string data in py-score column
clean_df2=clean_df2[pd.to_numeric(clean_df2['py-score'], errors='coerce').notnull()]
clean_df2

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [25]:
#summing up the duplicates rows/ duplicates
clean_df2.duplicated().sum()

0

In [28]:
#finding correlation using dummies method to turn string datatype columns into numerals
encoded_df2=pd.get_dummies(clean_df2)
correlation_matrix= encoded_df2.corr()
correlation_matrix

,Name_Emma,Name_Jesca,Name_Wilber,Name_Yeko,city_Kampala,city_Mbale,city_Mbarara,city_Tororo,age_20,age_21,age_23,age_26,py-score_75,py-score_84,py-score_90,py-score_94
Name_Emma,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333
Name_Jesca,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333
Name_Wilber,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333
Name_Yeko,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000
city_Kampala,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333
city_Mbale,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333
city_Mbarara,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333
city_Tororo,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000
age_20,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000
age_21,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333
age_23,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333
age_26,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333
py-score_75,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333
py-score_84,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333
py-score_90,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,-0.333333
py-score_94,-0.333333,-0.333333,-0.333333,1.000000,-0.333333,-0.333333,-0.333333,1.000000,1.000000,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,-0.333333,1.000000